Revit 2026 API

# FabricAreaFabricSheetTypeId Property

---

The id of the Fabric Sheet Type for this element.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId FabricSheetTypeId { get; set; }
```
```vb
Public Property FabricSheetTypeId As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ FabricSheetTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member FabricSheetTypeId : ElementId with get, set
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: fabricSheetTypeId is not a Fabric Sheet Type. |
| ArgumentNullException | When setting this property: A non-optional argument was null |

Changing the value of this property causes change of MinorLapSplice and MajorLapSplice properties if needed

#### Reference

FabricArea Class

Autodesk.Revit.DB.Structure Namespace